/**
  ******************************************************************************
  * 文件名          : MR2Init.c
  * 创建时间        : 2019.03.06
  * 作者            : 任云帆
  *-----------------------------------------------------------------------------
  * 最近修改时间    : 2019.03.06
  * 修改人          : 任云帆
  ******************************************************************************
  *								文件描述     								   *
  ******************************************************************************
  *	本文件定义了MR1所有的全局变量和MR1初始化函数。
  ******************************************************************************
  * 1.本代码基于STM32F427IIH6开发，编译环境为Keil 5，基于FreeRTOS进行开发。
  * 2.本代码只适用于Robocon 2019MR1机器人，不建议用于其他用途
  * 3.本代码以UTF-8格式编码，请勿以ANSI编码形式打开
  * 4.本代码包含大量中文注释，请仔细通读代码后使用
  * 5.本代码最终解释权归哈尔滨工业大学（深圳）Robocon战队所有
  *
  * Copyright (c) 2019 哈尔滨工业大学（深圳）Robocon战队 版权所有
  ******************************************************************************
  */

#include "MR2Init.h"
#include "string.h"
#include "UsartReceive.h"

MR2_s MR2;
uint8_t UsartReceiveGyro;
uint8_t UsartReceiveRemote[18];               //遥控器接收的原始数据
unsigned char sign;
char Re_buf[11];
/**
* @brief 机器人各种参数初始化
* @param None
* @retval None
* @TODO None
*/
void RobotParamInit()
{                              

}


