/**
  ******************************************************************************
  * 文件名          : MR1Init.c
  * 创建时间        : 2019.02.12
  * 作者            : 任云帆
  *-----------------------------------------------------------------------------
  * 最近修改时间    : 2019.02.15
  * 修改人          : 任云帆
  ******************************************************************************
  *								文件描述     								   *
  ******************************************************************************
  *	本文件定义了MR1所有的全局变量和MR1初始化函数。
  ******************************************************************************
  * 1.本代码基于STM32F427IIH6开发，编译环境为Keil 5，基于FreeRTOS进行开发。
  * 2.本代码只适用于Robocon 2019MR1机器人，不建议用于其他用途
  * 3.本代码以UTF-8格式编码，请勿以ANSI编码形式打开
  * 4.本代码包含大量中文注释，请仔细通读代码后使用
  * 5.本代码最终解释权归哈尔滨工业大学（深圳）Robocon战队所有
  *
  * Copyright (c) 2019 哈尔滨工业大学（深圳）Robocon战队 版权所有
  ******************************************************************************
  */

#include "MR2Init.h"
#include "string.h"
#include "UsartReceive.h"
#include "Action.h"
#include "SendSignal.h"

MR2_s MR2;
//大腿 0 小腿 1 臀部 2
//int ZeroPos[4][3]={ {144,132,134},{140,130,127},{140,131,146},{130,135,132}};

uint8_t UsartReceiveGyro;
uint8_t UsartReceiveRemote[18];               //遥控器接收的原始数据



/**
* @brief 机器人各种参数初始化
* @param None
* @retval None
* @TODO None
*/
//void RobotParamInit()
//{

//	
//	for(int i=0;i<4;i++){
//	calAngle(0,0,i,0);
//		calAngle(0,0,i,1);
//	}
//	SendSignal();
//}


